{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "TIME_DELTA=4.0": 5,
      "TIME_DELTA=2.0": 6,
      "BAR_END": 7,
      "BAR_START": 8,
      "NOTE_OFF=62": 9,
      "NOTE_ON=62": 10,
      "NOTE_OFF=60": 11,
      "NOTE_ON=60": 12,
      "NOTE_OFF=59": 13,
      "NOTE_ON=59": 14,
      "NOTE_OFF=64": 15,
      "NOTE_ON=64": 16,
      "NOTE_OFF=61": 17,
      "NOTE_ON=61": 18,
      "NOTE_OFF=57": 19,
      "NOTE_ON=57": 20,
      "NOTE_OFF=63": 21,
      "NOTE_ON=63": 22,
      "NOTE_OFF=58": 23,
      "NOTE_ON=58": 24,
      "NOTE_OFF=65": 25,
      "NOTE_ON=65": 26,
      "NOTE_OFF=66": 27,
      "NOTE_ON=66": 28,
      "NOTE_OFF=67": 29,
      "NOTE_ON=67": 30,
      "NOTE_OFF=55": 31,
      "NOTE_ON=55": 32,
      "NOTE_OFF=56": 33,
      "NOTE_ON=56": 34,
      "TIME_DELTA=1.0": 35,
      "TRACK_END": 36,
      "TRACK_START": 37,
      "NOTE_OFF=69": 38,
      "NOTE_ON=69": 39,
      "NOTE_OFF=68": 40,
      "NOTE_ON=68": 41,
      "NOTE_OFF=54": 42,
      "NOTE_ON=54": 43,
      "TIME_DELTA=8.0": 44,
      "NOTE_OFF=53": 45,
      "NOTE_ON=53": 46,
      "NOTE_OFF=70": 47,
      "NOTE_ON=70": 48,
      "NOTE_OFF=71": 49,
      "NOTE_ON=71": 50,
      "NOTE_OFF=52": 51,
      "NOTE_ON=52": 52,
      "NOTE_OFF=72": 53,
      "NOTE_ON=72": 54,
      "NOTE_OFF=51": 55,
      "NOTE_ON=51": 56,
      "NOTE_OFF=50": 57,
      "NOTE_ON=50": 58,
      "NOTE_OFF=73": 59,
      "NOTE_ON=73": 60,
      "NOTE_OFF=74": 61,
      "NOTE_ON=74": 62,
      "NOTE_OFF=49": 63,
      "NOTE_ON=49": 64,
      "NOTE_OFF=48": 65,
      "NOTE_ON=48": 66,
      "NOTE_OFF=75": 67,
      "NOTE_ON=75": 68,
      "NOTE_OFF=76": 69,
      "NOTE_ON=76": 70,
      "NOTE_OFF=47": 71,
      "NOTE_ON=47": 72,
      "NOTE_OFF=77": 73,
      "NOTE_ON=77": 74,
      "NOTE_OFF=46": 75,
      "NOTE_ON=46": 76,
      "NOTE_OFF=45": 77,
      "NOTE_ON=45": 78,
      "NOTE_OFF=78": 79,
      "NOTE_ON=78": 80,
      "TIME_DELTA=6.0": 81,
      "NOTE_OFF=79": 82,
      "NOTE_ON=79": 83,
      "NOTE_OFF=44": 84,
      "NOTE_ON=44": 85,
      "NOTE_OFF=43": 86,
      "NOTE_ON=43": 87,
      "TIME_DELTA=12.0": 88,
      "NOTE_OFF=80": 89,
      "NOTE_ON=80": 90,
      "NOTE_OFF=42": 91,
      "NOTE_ON=42": 92,
      "NOTE_OFF=81": 93,
      "NOTE_ON=81": 94,
      "NOTE_OFF=41": 95,
      "NOTE_ON=41": 96,
      "INST=0": 97,
      "INST=1": 98,
      "INST=2": 99,
      "INST=3": 100,
      "PIECE_START": 101,
      "DENSITY=3": 102,
      "NOTE_OFF=40": 103,
      "NOTE_ON=40": 104,
      "DENSITY=2": 105,
      "DENSITY=4": 106,
      "DENSITY=1": 107,
      "NOTE_OFF=82": 108,
      "NOTE_ON=82": 109,
      "NOTE_OFF=39": 110,
      "NOTE_ON=39": 111,
      "NOTE_OFF=83": 112,
      "NOTE_ON=83": 113,
      "NOTE_OFF=38": 114,
      "NOTE_ON=38": 115,
      "DENSITY=0": 116,
      "NOTE_OFF=84": 117,
      "NOTE_ON=84": 118,
      "NOTE_OFF=37": 119,
      "NOTE_ON=37": 120,
      "NOTE_OFF=36": 121,
      "NOTE_ON=36": 122,
      "NOTE_OFF=85": 123,
      "NOTE_ON=85": 124,
      "NOTE_OFF=35": 125,
      "NOTE_ON=35": 126,
      "NOTE_OFF=86": 127,
      "NOTE_ON=86": 128,
      "TIME_DELTA=3.0": 129,
      "NOTE_OFF=34": 130,
      "NOTE_ON=34": 131,
      "NOTE_OFF=33": 132,
      "NOTE_ON=33": 133,
      "NOTE_OFF=87": 134,
      "NOTE_ON=87": 135,
      "NOTE_OFF=88": 136,
      "NOTE_ON=88": 137,
      "NOTE_OFF=32": 138,
      "NOTE_ON=32": 139,
      "NOTE_OFF=31": 140,
      "NOTE_ON=31": 141,
      "TIME_DELTA=0.5": 142,
      "NOTE_OFF=89": 143,
      "NOTE_ON=89": 144,
      "TIME_DELTA=16.0": 145,
      "NOTE_OFF=30": 146,
      "NOTE_ON=30": 147,
      "NOTE_OFF=29": 148,
      "NOTE_ON=29": 149,
      "NOTE_OFF=90": 150,
      "NOTE_ON=90": 151,
      "INST=4": 152,
      "NOTE_OFF=28": 153,
      "NOTE_ON=28": 154,
      "NOTE_OFF=91": 155,
      "NOTE_ON=91": 156,
      "INST=5": 157,
      "INST=6": 158,
      "NOTE_OFF=27": 159,
      "NOTE_ON=27": 160,
      "NOTE_OFF=26": 161,
      "NOTE_ON=26": 162,
      "TIME_DELTA=10.0": 163,
      "INST=7": 164,
      "NOTE_OFF=92": 165,
      "NOTE_ON=92": 166,
      "NOTE_OFF=93": 167,
      "NOTE_ON=93": 168,
      "NOTE_OFF=94": 169,
      "NOTE_ON=94": 170,
      "NOTE_OFF=95": 171,
      "NOTE_ON=95": 172,
      "NOTE_OFF=24": 173,
      "NOTE_OFF=25": 174,
      "NOTE_ON=24": 175,
      "NOTE_ON=25": 176,
      "NOTE_OFF=96": 177,
      "NOTE_ON=96": 178,
      "INST=10": 179,
      "INST=11": 180,
      "INST=12": 181,
      "INST=13": 182,
      "INST=14": 183,
      "INST=8": 184,
      "INST=9": 185,
      "NOTE_OFF=97": 186,
      "NOTE_OFF=98": 187,
      "NOTE_ON=97": 188,
      "NOTE_ON=98": 189
    },
    "unk_token": "[UNK]"
  }
}